{
  "backend/main.mo": "Defines user, partner, client, layanan, task, ticket, and withdraw types with in-memory maps plus authorization, and exposes profile and ticket management methods.",
  "feature_evidence.json": "Feature evidence describing the InternalLogin page requirement for a conditional Claim Superadmin UI tied to backend calls.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, detailing routing, components, styling, and feature behaviors.",
  "frontend/index.css": "Tailwind base style definitions setting OKLCH color variables, radius, and theme tokens for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all client, partner, internal, and landing routes plus a custom 404 page.",
  "frontend/src/components/asistenku/Footer.tsx": "Footer with logo and a single copyright line.",
  "frontend/src/components/asistenku/Header.tsx": "Sticky header with desktop/mobile logos and navigation buttons for Masuk, Mulai, and Partner.",
  "frontend/src/components/asistenku/Hero.tsx": "Hero section with hero image, headline text, CTA to scroll to layanan, and WhatsApp link.",
  "frontend/src/components/asistenku/JoinTeamSection.tsx": "Section inviting users to join the team with a button navigating to partner registration.",
  "frontend/src/components/asistenku/LandingPage.tsx": "Landing page component with hero content, scroll-to-section behavior, and service phase descriptions.",
  "frontend/src/components/asistenku/layananCopy.ts": "Exports structured layananData defining service tiers, descriptions, pricing, and benefits.",
  "frontend/src/components/asistenku/LayananSection.tsx": "Renders an accordion list of services using layananData with pricing, details, and WhatsApp CTA.",
  "frontend/src/components/asistenku/Penutup.tsx": "Simple closing section displaying a short reassurance message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login flow, and identity persistence using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and global styling for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard with tabbed placeholder sections and basic header/footer layout.",
  "frontend/src/pages/asistenmu/AsistenmuDashboard.tsx": "Dashboard untuk asisten dengan ringkasan task dan tab navigasi, termasuk form internal seperti partner, jam efektif, dan scope.",
  "frontend/src/pages/client/ClientDashboard.tsx": "Dashboard client menampilkan ringkasan task, catatan pribadi, dan beberapa tab pengelolaan layanan serta progres.",
  "frontend/src/pages/client/LoginClient.tsx": "Halaman login client dengan tombol login simulasi, akses ruang kerja, dan navigasi ke pendaftaran.",
  "frontend/src/pages/client/RegisterClient.tsx": "Form pendaftaran client dengan input dasar dan tampilan konfirmasi setelah submit.",
  "frontend/src/pages/concierge/ConciergeDashboard.tsx": "Dashboard concierge dengan beberapa tab seperti pencarian, tiket, dan handling, semuanya placeholder.",
  "frontend/src/pages/finance/FinanceDashboard.tsx": "Dashboard finance berisi tab earnings, withdraw, export, dan log, seluruhnya masih placeholder.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Login page for internal staff with Internet Identity, role workspace buttons, and superadmin claim logic.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Internal registration form capturing basic user info and role, showing a confirmation screen after submission.",
  "frontend/src/pages/management/ManagementDashboard.tsx": "Management dashboard with tabbed summary, GMV, margin, and statistics sections, all placeholder content.",
  "frontend/src/pages/manajer/ManajerDashboard.tsx": "Manager dashboard with monitoring, approval, and log tabs, each currently showing placeholder content.",
  "frontend/src/pages/partner/LoginPartner.tsx": "Partner login page with Internet Identity UI mock and navigation to workspace or registration.",
  "frontend/src/pages/partner/PartnerDashboard.tsx": "Partner dashboard showing earnings summary and tabbed sections for profile, tasks, history, and wallet.",
  "frontend/src/pages/partner/RegisterPartner.tsx": "Partner registration form collecting basic info and showing a confirmation page after submission.",
  "frontend/src/pages/strategicpartner/StrategicPartnerDashboard.tsx": "Dashboard with tabbed sections for strategic partners, each showing a placeholder message and standard header/footer layout.",
  "frontend/src/pages/superadmin/SuperadminDashboard.tsx": "Superadmin dashboard featuring multiple tabs (user summary, status, audit, log) with placeholder content and a shared layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins such as typography and container queries.",
  "project_state.json": "Project metadata describing current state and constraints, including requirements for implementing the superadmin-claim flow."
}