{
  "backend/main.mo": "Defines actor with user, ticket, withdrawal, layanan, and task data structures plus access control, superadmin logic, and various user management queries/mutations.",
  "feature_evidence.json": "Lists feature evidence entries linking feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing their roles and behaviors.",
  "frontend/index.css": "Configures global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point containing root div and script loader for the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages including dashboards, auth pages, and landing components.",
  "frontend/src/components/asistenku/Footer.tsx": "Simple footer displaying logo and copyright text.",
  "frontend/src/components/asistenku/Header.tsx": "Responsive header with logo variants and navigation buttons for login, scroll, and partner registration.",
  "frontend/src/components/asistenku/Hero.tsx": "Hero section with image, marketing text, CTA button scrolling to layanan, and WhatsApp link.",
  "frontend/src/components/asistenku/JoinTeamSection.tsx": "Renders a call-to-action section inviting users to join the team and navigates to the partner registration page.",
  "frontend/src/components/asistenku/LandingPage.tsx": "Builds the main landing page with hero content, service phases, scroll-to-section behavior, and multiple subcomponents.",
  "frontend/src/components/asistenku/layananCopy.ts": "Exports structured service data including pricing, descriptions, benefits, and contact links.",
  "frontend/src/components/asistenku/LayananSection.tsx": "Displays an accordion-based list of services using predefined data and includes CTA buttons linking to WhatsApp.",
  "frontend/src/components/asistenku/Penutup.tsx": "Shows a simple closing message reinforcing service quality.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and identity persistence.",
  "frontend/src/index.css": "Defines global Tailwind styles and custom CSS variables for themes and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers before rendering the root component.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Renders an admin dashboard with tabbed sections, placeholders, and a simple header and footer.",
  "frontend/src/pages/asistenmu/AsistenmuDashboard.tsx": "Dashboard untuk asisten yang menampilkan ringkasan statistik dan tab navigasi dengan berbagai form input.",
  "frontend/src/pages/client/ClientDashboard.tsx": "Dashboard client berisi ringkasan task, catatan pribadi, dan navigasi tab untuk berbagai fitur.",
  "frontend/src/pages/client/LoginClient.tsx": "Halaman login client dengan tombol masuk simulasi dan navigasi ke dashboard atau pendaftaran.",
  "frontend/src/pages/client/RegisterClient.tsx": "Halaman pendaftaran client yang mengirim data profil ke backend dan menampilkan konfirmasi setelah submit.",
  "frontend/src/pages/concierge/ConciergeDashboard.tsx": "Dashboard concierge dengan tab navigasi untuk berbagai kategori tiket, semuanya masih placeholder.",
  "frontend/src/pages/finance/FinanceDashboard.tsx": "Dashboard finance dengan tab earnings, withdraw, export, dan log, seluruhnya masih placeholder.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Handles Internet Identity login, superadmin claiming, and role-based workspace navigation with status checks and error toasts.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Provides internal user registration via Internet Identity, saving profiles to the backend and showing a submission confirmation.",
  "frontend/src/pages/management/ManagementDashboard.tsx": "Displays a management dashboard with tabbed placeholder sections such as Summary, GMV, Margin, and Statistik.",
  "frontend/src/pages/manajer/ManajerDashboard.tsx": "Shows a manager dashboard containing Monitoring, Approval, and Log tabs, each currently with placeholder content.",
  "frontend/src/pages/partner/LoginPartner.tsx": "Renders a partner login page with a placeholder Internet Identity login and navigation to dashboard or registration.",
  "frontend/src/pages/partner/PartnerDashboard.tsx": "Provides the partner dashboard UI including earnings summary and multiple tabs for profile, tasks, history, and wallet.",
  "frontend/src/pages/partner/RegisterPartner.tsx": "Implements partner registration by saving a profile via actor then showing a confirmation screen.",
  "frontend/src/pages/strategicpartner/StrategicPartnerDashboard.tsx": "Renders the strategic partner dashboard with a header, footer, and tabbed sections that currently show placeholder content.",
  "frontend/src/pages/superadmin/SuperadminDashboard.tsx": "Implements the superadmin dashboard with tabs, user fetching via actor methods, pending user filtering, and activation handling for client and partner accounts.",
  "frontend/src/utils/internalRoleRouting.ts": "Maps internal role keys to dashboard routes and provides helpers for checking and listing routable roles.",
  "frontend/src/utils/internalRoles.ts": "Defines all internal roles with labels and exposes helpers for retrieving role labels.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, extensions, and plugins for the project.",
  "project_state.json": "Describes the current project state, including frontend-only requirements for user activation, role handling, and registration behavior."
}