{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing frontend routing, import, and stability requirements with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend components, pages, and config files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark theme tokens, and applying global background/text/border styles.",
  "frontend/index.html": "Static HTML template mounting the React app into a root div and loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup with a root route, all page routes, and a styled NotFound component rendered via notFoundComponent.",
  "frontend/src/components/asistenku/Footer.tsx": "Footer showing the Asistenku icon and copyright text.",
  "frontend/src/components/asistenku/Header.tsx": "Sticky header with logos and navigation buttons for login, layanan scroll, and partner registration.",
  "frontend/src/components/asistenku/Hero.tsx": "Hero section with hero image, headline text, CTA button scrolling to layanan, and WhatsApp link.",
  "frontend/src/components/asistenku/JoinTeamSection.tsx": "Section inviting users to join the team with a button navigating to partner registration.",
  "frontend/src/components/asistenku/LandingPage.tsx": "Landing page composing header, hero, layanan, join team, penutup, and footer sections.",
  "frontend/src/components/asistenku/layananCopy.ts": "Defines an array of service tier data with pricing, descriptions, and WhatsApp links.",
  "frontend/src/components/asistenku/LayananSection.tsx": "Accordion-based layanan grid rendering layananData with details, pricing, and WhatsApp CTA buttons.",
  "frontend/src/components/asistenku/Penutup.tsx": "Closing section with centered reassurance text about service quality.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, identity loading, and status handling.",
  "frontend/src/index.css": "Tailwind setup defining global CSS variables for themes and applying base styles.",
  "frontend/src/main.tsx": "Initializes the app by wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/client/LoginClient.tsx": "Client login UI with Internet Identity button, workspace placeholder, and navigation to registration.",
  "frontend/src/pages/client/RegisterClient.tsx": "Client registration form handling basic user info and showing a confirmation screen after submission.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login UI with Internet Identity placeholder and role-based workspace navigation options.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Internal user registration form collecting basic info and role, showing a confirmation screen after submission.",
  "frontend/src/pages/partner/LoginPartner.tsx": "Static partner login UI with placeholder Internet Identity button and navigation to registration.",
  "frontend/src/pages/partner/RegisterPartner.tsx": "Partner registration form capturing name, email, and WhatsApp, followed by a simple submitted-confirmation screen.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project state file describing requirements, constraints, and notes for Asistenku’s static pages and routing setup."
}