{
  "backend/main.mo": "Motoko canister defining user profiles, tickets, withdrawals, layanan, tasks, and access‑controlled CRUD with superadmin claiming and role checks.",
  "feature_evidence.json": "Feature evidence report listing required frontend route additions and related components for dashboard pages.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including routing, pages, components, and styling.",
  "frontend/index.css": "Tailwind base layer with color variables, dark mode values, and global border/background styles.",
  "frontend/index.html": "Base HTML document mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main router configuration defining root, landing, auth, internal, and seven dashboard routes with a custom 404 component.",
  "frontend/src/components/asistenku/Footer.tsx": "Footer component showing logo and copyright text.",
  "frontend/src/components/asistenku/Header.tsx": "Sticky header with logo variants and navigation buttons for client login, layanan scroll, and partner registration.",
  "frontend/src/components/asistenku/Hero.tsx": "Hero section with large image, headline text, scroll‑to‑layanan CTA, and WhatsApp link.",
  "frontend/src/components/asistenku/JoinTeamSection.tsx": "Section inviting users to join the team with a button navigating to partner registration.",
  "frontend/src/components/asistenku/LandingPage.tsx": "Landing page component with hero content, service phase cards, and navigation to the layanan section.",
  "frontend/src/components/asistenku/layananCopy.ts": "Static data file defining layanan tiers, pricing, benefits, and WhatsApp links.",
  "frontend/src/components/asistenku/LayananSection.tsx": "Displays layanan packages in an accordion layout using data from layananCopy.",
  "frontend/src/components/asistenku/Penutup.tsx": "Simple closing section showing a brief reassurance message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance tied to Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard layout with tabbed sections for users, layanan, tasks, approvals, and logs.",
  "frontend/src/pages/asistenmu/AsistenmuDashboard.tsx": "Dashboard UI for assistants with summary stats and multi-tab sections for profile, summary, and task management.",
  "frontend/src/pages/client/ClientDashboard.tsx": "Client dashboard showing task summaries, personal notes, and navigational tabs for profile, services, tasks, history, tickets, and concierge hub.",
  "frontend/src/pages/client/LoginClient.tsx": "Login page for clients with buttons for simulated authentication and navigation to registration.",
  "frontend/src/pages/client/RegisterClient.tsx": "Client registration form collecting basic info and showing a confirmation screen after submission.",
  "frontend/src/pages/concierge/ConciergeDashboard.tsx": "Concierge dashboard with multiple placeholder tabs for search, tickets, creation, handling, and completed items.",
  "frontend/src/pages/finance/FinanceDashboard.tsx": "Finance dashboard featuring tabs for earnings, withdrawals, exports, and logs, all currently placeholder content.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login page handling Internet Identity auth, role workspace selection, and superadmin claim flow.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Internal registration form collecting basic info and role, ending with a submission confirmation screen.",
  "frontend/src/pages/management/ManagementDashboard.tsx": "Management dashboard with tabbed sections for summary and metrics placeholders.",
  "frontend/src/pages/manajer/ManajerDashboard.tsx": "Manager dashboard featuring monitoring, approval, and log tabs with placeholder content.",
  "frontend/src/pages/partner/LoginPartner.tsx": "Partner login page with Internet Identity button, workspace access, and link to registration.",
  "frontend/src/pages/partner/PartnerDashboard.tsx": "Partner dashboard showing summary stats and tabs for profile, tasks, history, and wallet.",
  "frontend/src/pages/partner/RegisterPartner.tsx": "Partner registration form collecting basic info and showing a confirmation after submission.",
  "frontend/src/pages/strategicpartner/StrategicPartnerDashboard.tsx": "React dashboard page with header, tab navigation, placeholder tab content, and footer for strategic partners.",
  "frontend/src/pages/superadmin/SuperadminDashboard.tsx": "React dashboard page with header, tab navigation, placeholder sections, and footer for superadmin users.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and managing persisted parameter retrieval.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, shadows, animations, and loading plugins.",
  "project_state.json": "Project metadata describing required frontend route additions and constraints for updating App.tsx."
}