{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "JSON report describing feature requirements, affected files, and components for build verification.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional summaries of each component or page.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining color system, radius, and dark mode styles.",
  "frontend/index.html": "Basic HTML root document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with landing, client, partner, and internal routes plus a custom 404 page.",
  "frontend/src/components/asistenku/Footer.tsx": "Simple footer with logo and copyright line.",
  "frontend/src/components/asistenku/Header.tsx": "Sticky header with responsive logos and navigation buttons including scroll-to-layanan.",
  "frontend/src/components/asistenku/Hero.tsx": "Standalone hero section with image, headline, description, and CTA buttons.",
  "frontend/src/components/asistenku/JoinTeamSection.tsx": "Section inviting users to join the team with a button linking to partner registration.",
  "frontend/src/components/asistenku/LandingPage.tsx": "Full landing layout including custom hero, informational sections, and collapsible pricing cards, plus header and footer components.",
  "frontend/src/components/asistenku/layananCopy.ts": "Exports static array of service package definitions including pricing, details, and WhatsApp links.",
  "frontend/src/components/asistenku/LayananSection.tsx": "Renders an accordion list of service tiers using layananData, displaying details and a WhatsApp action button.",
  "frontend/src/components/asistenku/Penutup.tsx": "Simple closing section showing a centered message about service quality.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, and identity loading logic.",
  "frontend/src/index.css": "Tailwind base setup defining CSS variables for themes and applying global styles.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/client/LoginClient.tsx": "UI page for client login with mock Internet Identity button and navigation to registration.",
  "frontend/src/pages/client/RegisterClient.tsx": "Client registration form that shows a confirmation message after submission.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login page with mock Internet Identity login and role-based entry options.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Internal registration form that collects user info and role, shows a confirmation screen after submission, and navigates to internal login.",
  "frontend/src/pages/partner/LoginPartner.tsx": "UI-only partner login page with placeholder login buttons and navigation to the partner registration page.",
  "frontend/src/pages/partner/RegisterPartner.tsx": "Partner registration form collecting basic info and showing a confirmation screen before navigating back to login.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project metadata tracking landing page requirements, constraints, architectural notes, known issues, and existing features."
}