{
  "backend/main.mo": "Empty Motoko actor definition.",
  "feature_evidence.json": "Feature evidence report describing a required insertion of a new micro-authority block in LandingPage.tsx.",
  "frontend-file-summaries.txt": "List of short summaries for all major frontend components and pages.",
  "frontend/index.css": "Tailwind base setup defining global OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines TanStack Router routes for landing and all auth pages with a custom 404 component.",
  "frontend/src/components/asistenku/Footer.tsx": "Simple footer showing logo and copyright text.",
  "frontend/src/components/asistenku/Header.tsx": "Sticky header with responsive logos and navigation buttons.",
  "frontend/src/components/asistenku/Hero.tsx": "Hero section with image, headline, description, and CTA buttons.",
  "frontend/src/components/asistenku/JoinTeamSection.tsx": "Call‑to‑action section linking to partner registration.",
  "frontend/src/components/asistenku/LandingPage.tsx": "Full landing page combining hero, guidance steps, pricing cards, CTA sections, and footer.",
  "frontend/src/components/asistenku/layananCopy.ts": "Defines an array of service plan objects with features, pricing, and WhatsApp links.",
  "frontend/src/components/asistenku/LayananSection.tsx": "Layanan section rendering accordion-based service cards from layananData.",
  "frontend/src/components/asistenku/Penutup.tsx": "Closing section with a single reassurance sentence.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, and status handling.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for themes, including dark mode tokens.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/client/LoginClient.tsx": "Client login UI with Internet Identity button and navigation to registration.",
  "frontend/src/pages/client/RegisterClient.tsx": "Client registration form that submits basic info and shows a confirmation screen.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal team login page offering Internet Identity login and role-based workspace shortcuts.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Internal registration form capturing basic user data and role, showing a confirmation screen after submission.",
  "frontend/src/pages/partner/LoginPartner.tsx": "Partner login UI with placeholder Internet Identity button and navigation to registration.",
  "frontend/src/pages/partner/RegisterPartner.tsx": "Partner registration form collecting name, email, and WhatsApp, followed by a submission confirmation view.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, radii, shadows, animations, and plugin integrations.",
  "project_state.json": "Project metadata describing required landing page updates, constraints, routing rules, and known issues."
}