{
  "kind": "build_request",
  "title": "Add a titleless micro-authority block under “Tepat Tanpa Kehilangan Waktu” on the landing page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "Update only `frontend/src/components/asistenku/LandingPage.tsx` to insert a new, titleless micro-authority block directly under the existing “Tepat Tanpa Kehilangan Waktu” section and before the existing “Unit Layanan” section, without removing or modifying any existing sections (including “Unit Layanan”) and without moving the “Fase Layanan (Pricing)” section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-8"
        ],
        "quotes": [
          "Letaknya tepat di bawah: Tepat Tanpa Kehilangan Waktu",
          "Bukan menghapus “Unit Layanan”.",
          "Tanpa judul. Tidak ada: “Konversi Layanan” ...",
          "✅ YA. Persis."
        ]
      },
      "acceptanceCriteria": [
        "File changed: only `frontend/src/components/asistenku/LandingPage.tsx` is modified.",
        "The landing page section order includes: “Tepat Tanpa Kehilangan Waktu” -> (new micro-authority block) -> existing “Unit Layanan” -> existing “Fase Layanan (Pricing)”.",
        "The new block renders with no section title, no extra UI elements (no emoji, no divider, no card/box/shadow wrapper, no highlight).",
        "The new block uses exactly the following JSX structure and Tailwind classes (no additions/removals beyond what is necessary to place it in the page):\n\n<section className=\"py-8\">\n  <div className=\"max-w-xl mx-auto text-center\">\n    <p className=\"text-sm text-gray-600 leading-snug\">\n      Struktur kami menjaga keseimbangan antara kualitas dan ketepatan.\n    </p>\n    <p className=\"text-sm text-gray-600 italic leading-snug\">\n      Konversi unit layanan ditentukan melalui standar kerja yang terukur.\n      Anda tidak perlu menghitung, menegosiasikan, atau memikirkan angka di level eksekusi.\n    </p>\n  </div>\n</section>",
        "The text content in the new block matches exactly (including punctuation and line breaks within the JSX):\n- \"Struktur kami menjaga keseimbangan antara kualitas dan ketepatan.\"\n- \"Konversi unit layanan ditentukan melalui standar kerja yang terukur.\"\n- \"Anda tidak perlu menghitung, menegosiasikan, atau memikirkan angka di level eksekusi.\"",
        "The existing “Unit Layanan” section remains present and unchanged from its current copy and styling."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text in this build request document (the app UI copy itself must remain exactly as specified in Indonesian).",
    "Frontend change scope: modify only `frontend/src/components/asistenku/LandingPage.tsx` for this request.",
    "Do not change any existing landing page copy, pricing strings, capitalization, ordering, links, or section IDs except for inserting the new micro-authority block.",
    "Do not add any backend changes, API calls, or authentication integration."
  ],
  "nonGoals": [
    "Do not redesign the landing page visual theme beyond the inserted block’s specified classes.",
    "Do not change routing, header navigation, login/register pages, internal pages, or the pricing accordion behavior.",
    "Do not remove, rename, or merge the existing “Unit Layanan” section."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}