{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Insert titleless micro-authority block on Asistenku landing page",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Insert a new titleless micro-authority block directly below the “Tepat Tanpa Kehilangan Waktu” section and before the existing “Unit Layanan” section, without changing any other landing page sections or their order.",
      "acceptanceCriteria": [
        "Only `frontend/src/components/asistenku/LandingPage.tsx` is modified.",
        "The landing page section order is: “Tepat Tanpa Kehilangan Waktu” -> (new micro-authority block) -> existing “Unit Layanan” -> existing “Fase Layanan (Pricing)”.",
        "The new block renders without any section title and without extra UI elements (no emoji, no divider, no card/box/shadow wrapper, no highlight).",
        "The inserted JSX matches exactly the required structure and Tailwind classes (no additions/removals beyond what is necessary to place it in the page).",
        "The new block text content matches exactly (including punctuation and JSX line breaks): “Struktur kami menjaga keseimbangan antara kualitas dan ketepatan.” and “Konversi unit layanan ditentukan melalui standar kerja yang terukur.” and “Anda tidak perlu menghitung, menegosiasikan, atau memikirkan angka di level eksekusi.”",
        "The existing “Unit Layanan” section remains present and unchanged in copy and styling.",
        "The existing “Fase Layanan (Pricing)” section is not moved and remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/asistenku/LandingPage.tsx",
          "operation": "modify",
          "description": "Insert the specified titleless micro-authority <section className=\"py-8\"> block immediately after the existing “Tepat Tanpa Kehilangan Waktu” section and immediately before the existing “Unit Layanan” section. Keep all existing sections (including “Unit Layanan”) unchanged and keep the “Fase Layanan (Pricing)” section in its current position; do not alter any other copy, links, IDs, ordering, or styling outside inserting this exact block."
        }
      ]
    }
  ]
}